Revit 2026 API

# LinePatternSetSegments Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSegments(
	IList<LinePatternSegment> lineSegs
)
```
```vb
Public Sub SetSegments (
	lineSegs As IList(Of LinePatternSegment)
)
```
```cpp
public:
void SetSegments(
	IList<LinePatternSegment^>^ lineSegs
)
```
```fsharp
member SetSegments :
        lineSegs : IList<LinePatternSegment> -> unit
```

#### Parameters

lineSegs IListLinePatternSegment

#### Reference

LinePattern Class

Autodesk.Revit.DB Namespace